#### OpenTofu Format and Style 🖌`success`
#### OpenTofu Initialization ⚙️`success`
#### OpenTofu Validation 🤖`success`
<details><summary>Validation Output</summary>

```golang

Success! The configuration is valid.

```

</details>

#### OpenTofu Plan 📖`success`

<details><summary>Show Plan</summary>

```golang

tofu

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

OpenTofu will perform the following actions:

  # module.k3s-controlplane.digitalocean_droplet.opsdev will be created
  + resource "digitalocean_droplet" "opsdev" {
      + backups              = false
      + created_at           = (known after apply)
      + disk                 = (known after apply)
      + graceful_shutdown    = false
      + id                   = (known after apply)
      + image                = "ubuntu-24-10-x64"
      + ipv4_address         = (known after apply)
      + ipv4_address_private = (known after apply)
      + ipv6                 = false
      + ipv6_address         = (known after apply)
      + locked               = (known after apply)
      + memory               = (known after apply)
      + monitoring           = false
      + name                 = "k3s-control-1"
      + price_hourly         = (known after apply)
      + price_monthly        = (known after apply)
      + private_networking   = (known after apply)
      + region               = "sfo3"
      + resize_disk          = true
      + size                 = "s-1vcpu-2gb"
      + status               = (known after apply)
      + tags                 = [
          + "controlplane",
          + "do-droplet",
          + "k3s",
          + "k3s-control-1",
          + "opentofu",
          + "sfo3",
          + "ubuntu-24-10-x64",
        ]
      + urn                  = (known after apply)
      + vcpus                = (known after apply)
      + volume_ids           = (known after apply)
      + vpc_uuid             = "fce3e29f-bc4d-4edd-b19e-1780919c67c9"
    }

  # module.k3s-controlplane.digitalocean_volume_attachment.opsdev will be created
  + resource "digitalocean_volume_attachment" "opsdev" {
      + droplet_id = (known after apply)
      + id         = (known after apply)
      + volume_id  = "a60d875b-f27f-11ef-8494-0a58ac120307"
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tf-digitalocean.plan

To perform exactly these actions, run the following command to apply:
    tofu apply "tf-digitalocean.plan"

```

</details>

*Pusher: @TheOpsDev, Action: `pull_request`, Working Directory: `opentofu/digitalocean`, Workflow: `OpenTofu Comment PR`*